InformationRegisters/ОповещенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОповещенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПрочтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОповещенияПользователей/Forms/ОповещениеУпр/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ОтправитьСервер(НомерСообщения, Сообщение, Ответ);
    
    
    Получатель=ПараметрыСеанса.ТекущийПользователь;	
    
    УстановитьПривилегированныйРежим(Истина);
    
    Набор = РегистрыСведений.ОповещенияПользователей.СоздатьНаборЗаписей();
    Набор.Отбор.Получатель.Установить(Получатель);
    Набор.Отбор.НомерСообщения.Установить(НомерСообщения);
    Набор.Прочитать();
    
    Если Набор.Количество() > 0 Тогда
        
        НовыйНабор = Набор[0];
        
        НовыйНабор.ВремяПрочтения = Дата(1,1,1, час(ТекущаяДата()),Минута(ТекущаяДата()), Секунда(ТекущаяДата()));
        НовыйНабор.Прочитано = Истина;
        НовыйНабор.Ответ = Ответ;
        
        Набор.Записать();
    КонецЕсли;
    
    Если ПривилегированныйРежим() Тогда
        
        УстановитьПривилегированныйРежим(Ложь);
        
    КонецЕсли; 
    
КонецПроцедуры 


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    ПоказатьОповещениеПользователя (Заголовок,ПолучитьНавигационнуюСсылку(ЭтаФорма),Тема, БиблиотекаКартинок.РегламентноеЗадание);
    
    Если ТолькоПросмотр Тогда
        
        Элементы.Отправить.Доступность = Ложь;
        Элементы.ПрочитатьПозднее.Доступность = Ложь;
        Элементы.ЗакрытьПрограмму.Доступность = Ложь;
        
    Иначе
        
        ЗаписатьОповещениеОДоставкеНаСервере();
        
    КонецЕсли; 
    
    
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
    
    Если ЗавершитьРаботу = Истина Тогда
        
        ЗавершитьРаботуСистемы();
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти  



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Прочитано(Команда)
    
    ОтправитьСервер(НомерСообщения,Сообщение, Ответ);
    
    ОчиститьСообщения();
    
    Оповестить("ОбновитьСписок");
    
    Закрыть();
    
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьПрограмму(Команда)
    
    ЗавершитьРаботу=Истина;
    
    Прочитано(Неопределено);	
    
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьПозднее(Команда)
    
    ЗаписатьОповещениеОДоставкеНаСервере();
    
    Закрыть();
    
КонецПроцедуры


#КонецОбласти  


#Область ДополнительныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьОповещениеОДоставкеНаСервере()
    
    ПараметрыЗаписиОДоставке = РегистрыСведений.ОповещенияПользователей.СтруктураОбработкиОповещения();
    
    ЗаполнитьЗначенияСвойств(ПараметрыЗаписиОДоставке,ЭтаФорма);
    
    РегистрыСведений.ОповещенияПользователей.ЗаписатьОповещениеОДоставке(ПараметрыЗаписиОДоставке);	
    
КонецПроцедуры


#КонецОбласти
